Autodesk.Revit.DB.TessellatedBuildIssueType
Types of issues encountered while constructing geometrical objects
from the tessellatted face sets.
Since:
2015
Issues, which can be encountered while building a polymesh,
or a shell, or a solid from data, describing
tessellated shapes.
Since:
2015

Autodesk.Revit.DB.TessellatedBuildIssueType.NumberOfIssueTypes
Not a code of some issue, but the number of known types of issues.
Issues of this type should not be
present in TessellatedShapeBuilderResult. Please notify
Autodesk support if encountered

Autodesk.Revit.DB.TessellatedBuildIssueType.NotSetYet
An issue has not been set yet.

Autodesk.Revit.DB.TessellatedBuildIssueType.UnarticulatedNonManifoldEdge
An input face is mising an edge conecting two non-adjacent vertices
from its boundaries, which are adjacent in the boundaries of
some other face(s). If such an edge would be added, it would
split the face and result in 'NonManifoldEdge' or other issues.
Associated numbers are indices of a face which misses an edge
and indices of one or two faces in which boundaries such edge is
present.

Autodesk.Revit.DB.TessellatedBuildIssueType.InternalMissingError
An internal Revit problem. Issues of this type should not be
present in TessellatedShapeBuilderResult. Please notify
Autodesk support if encountered.
Associated number is face index.

Autodesk.Revit.DB.TessellatedBuildIssueType.InternalLightError
An internal Revit problem. Issues of this type should not be
present in TessellatedShapeBuilderResult. Please notify
Autodesk support if encountered.
Associated number is face index.

Autodesk.Revit.DB.TessellatedBuildIssueType.InternalError
An internal Revit problem. Issues of this type should not be
present in TessellatedShapeBuilderResult. Please notify
Autodesk support if encountered.
Associated number is face index.

Autodesk.Revit.DB.TessellatedBuildIssueType.InternalUtilityError
An internal Revit problem. Issues of this type should not be
present in TessellatedShapeBuilderResult. Please notify
Autodesk support if encountered.

Autodesk.Revit.DB.TessellatedBuildIssueType.TooSmallVertexSegementDistInFinalLoop
A face loop with too small vertex-segment distance.
Associated numbers are face, loop, segment and vertex
indices respectively

Autodesk.Revit.DB.TessellatedBuildIssueType.InconsitentMultiEdgeTraversalForFlip
A face edge with topological problems.
Associated numbers are indices of the involved faces.

Autodesk.Revit.DB.TessellatedBuildIssueType.EdgeTraversalForFlip
A face edge with topological problems.
Associated numbers are indices of the face, loop and vertex and an index
of another involved face respectively.

Autodesk.Revit.DB.TessellatedBuildIssueType.PartitionPointsTooFarFromTrueEdge
Points representing partitions of input points are too far from
the true edge.
Associated numbers are face and loop indices, an index of the
vertex in the beginning of the segment which is too far from
the corresponding true edge, an index of another involved face
respectively.

Autodesk.Revit.DB.TessellatedBuildIssueType.OverlappingAdjacentFaces
Adjacent faces which either exactly overlaps or have a too
acute angle between them. This issue can be reported for face
sets with duplicate faces as well.
Associated numbers are face and loop indices of one face and
face and loop indices of another face respectively.

Autodesk.Revit.DB.TessellatedBuildIssueType.NonManifoldEdge
Same edge is used by more than two faces.
This issue can be posted for topologically impossible face sets
as well as for face sets with duplicate faces.
Associated numbers are face and loop in which the problem became
obvious indices respectively.

Autodesk.Revit.DB.TessellatedBuildIssueType.EdgeTwiceUsedByFace
A face with an edge encountered in the loops multiple times.
Associated numbers are face and loop in which the problem became
obvious indices respectively.

Autodesk.Revit.DB.TessellatedBuildIssueType.InconsistentInnerOuterOriginalLoopCCW
A face where the CCW of inner loop is inconsistent with CCW of the
outer loop.
Associated numbers are face and inner loop indices respectively.

Autodesk.Revit.DB.TessellatedBuildIssueType.DegenOriginalLoop
A degenerate face loop is degenerate.
Associated numbers are face and loop indices respectively.

Autodesk.Revit.DB.TessellatedBuildIssueType.OuterLoopIsNotFirst
A face have multiple loops, but the outer loop is not listed as the
very first one.
Associated numbers are face and loop indices respectively.

Autodesk.Revit.DB.TessellatedBuildIssueType.OriginalLoopsProximity
A face with excessive proximity between face loops.
Associated numbers are face and two loop indices respectively.

Autodesk.Revit.DB.TessellatedBuildIssueType.FaceWithIslands
A face which has a loop inside a loop inside a loop.
Associated numbers are face and three loop indices respectively.

Autodesk.Revit.DB.TessellatedBuildIssueType.IntersectingOriginalLoops
A face whose loops intersect.
Associated numbers are face and two loop indices respectively.

Autodesk.Revit.DB.TessellatedBuildIssueType.LoopOnBestFitSelfIntersects
A face loop whose projection of the best-fit-plane self-intersects.
Associated numbers are face, loop, and two segments
indices respectively.

Autodesk.Revit.DB.TessellatedBuildIssueType.TooSmallVertexSegementDistInOriginalLoop
A face loop with too small vertex-segment distance.
Associated numbers are face, loop, segment and vertex
indices respectively.

Autodesk.Revit.DB.TessellatedBuildIssueType.OriginalPointsTooFarFromTheirPlane
A face whose original points taken together do define a plane, but some of
them lie to far from it.
An associated number is face index.

Autodesk.Revit.DB.TessellatedBuildIssueType.NonPlanarFace
A face which is not planar.
An associated number is face index.

Autodesk.Revit.DB.TessellatedBuildIssueType.LostAllLoops
A face, which originally had enough loops lost all of
them during purges.
An associated number is face index.

Autodesk.Revit.DB.TessellatedBuildIssueType.OriginalLoopMeshAcuteAngle
A face loop with a too acute angle between adjacent segments.
This condition is not relevant for polymesh construction.
Associated numbers are face, loop and point between segments
indices respectively.

Autodesk.Revit.DB.TessellatedBuildIssueType.OriginalLoopGeomAcuteAngle
A face loop with a too acute angle between adjacent segments.
This condition is not relevant for polymesh construction.
Associated numbers are face, loop and point between segments
indices respectively.

Autodesk.Revit.DB.TessellatedBuildIssueType.LostTooManyLoopVertices
A face loop, which originally had enough vertices, but lost too
many of them, while purging pseudo-duplicates.
Associated numbers are face index and loop index respectively.

Autodesk.Revit.DB.TessellatedBuildIssueType.TooShortOriginalLoopGeomSegment
A face loop, containing a segment which is too short for a geometry,
but not for a mesh.
Associated numbers are face, loop and point indices respectively
(the segment goes from the previous point to this one).

Autodesk.Revit.DB.TessellatedBuildIssueType.TooShortOriginalLoopMeshSegment
A face loop, containing a segment which is too short even for a mesh.
Associated numbers are face, loop and point indices respectively
(the segment goes from the previous point to this one).

Autodesk.Revit.DB.TessellatedBuildIssueType.TooFewOriginalVertices
A face loop, which from the very beginning does not have enough points.
Associated numbers are face index and loop index respectively.

Autodesk.Revit.DB.TessellatedBuildIssueType.EmptyLoop
A face loop which does not have any points.
Associated numbers are face index and loop index respectively.

Autodesk.Revit.DB.TessellatedBuildIssueType.EmptyFace
A face which does not have any loops.
An associated number is face index.

Autodesk.Revit.DB.TessellatedBuildIssueType.AllFine
No issues were encountered. Issues of this type should not
be present in TessellatedShapeBuilderResult.